#+TITLE: LOC
#+DATE: 2022-09-20T22:55:17+0800
#+LASTMOD: 2022-09-20T22:55:17+0800
#+AUTHOR: Jiacai Liu
#+LANGUAGE: cn
#+EMAIL: dev@liujiacai.net
#+OPTIONS: toc:nil num:nil
#+STARTUP: content

[[https://github.com/jiacai2050/loc/actions/workflows/CI.yml][https://github.com/jiacai2050/loc/actions/workflows/CI.yml/badge.svg]]
[[https://github.com/jiacai2050/loc/actions/workflows/binary.yml][https://github.com/jiacai2050/loc/actions/workflows/binary.yml/badge.svg]]

Lines of code in Zig

Prebuilt binaries can be found in [[https://github.com/jiacai2050/loc/actions/workflows/binary.yml][CI's artifacts]], or you can build from source:
#+begin_src bash
git clone --recurse-submodules https://github.com/jiacai2050/loc.git
#+end_src
Then
#+begin_src bash :results verbatim :exports both
zig build -Drelease-fast
./zig-out/bin/loc
#+end_src

#+RESULTS:
: Language Files Lines Code Comment Blank Size
: -------- ----- ----- ---- ------- ----- -------
: Zig      3     397   343  5       49    11.18K
: YAML     2     74    69   0       5     1.54K
: Python   1     10    7    2       1     166.00B
: Makefile 1     9     6    0       3     86.00B
: Ruby     1     8     5    2       1     201.00B
: -------- ----- ----- ---- ------- ----- -------
: Total    8     498   430  9       59    13.16K


* Roadmap
- Performance, at least comparable with [[https://github.com/cgag/loc][cgag/loc]] [[https://github.com/jiacai2050/loc/issues/1][#1]]
- More options, such as =--exclude <regex>=, =--sort <COLUMN>=
- Support multiline comment
